#coding=utf-8
import plotly.graph_objs as go
import plotly.offline as py


a = [('1_德国', 81, 59, 50, 21, 13), ('2_巴西', 84, 51, 53, 28, 13), ('3_葡萄牙', 49, 41, 40, 16, 11), ('4_阿根廷', 68, 53, 48, 25, 9), ('5_比利时', 27, 31, 26, 8, 11), ('6_西班牙', 59, 43, 41, 17, 11), ('7_波兰', 26, 42, 24, 5, 9), ('8_瑞士', 40, 42, 27, 8, 9), ('9_法国', 61, 52, 46, 22, 14), ('11_秘鲁', 25, 52, 36, 5, 19), ('12_丹麦', 40, 42, 32, 10, 15), ('13_哥伦比亚', 33, 32, 35, 9, 11), ('15_克罗地亚', 35, 35, 31, 11, 11), ('16_英格兰', 57, 43, 40, 20, 10), ('17_墨西哥', 42, 52, 41, 13, 15), ('18_瑞典', 45, 48, 34, 12, 16), ('20_冰岛', 26, 59, 27, 2, 20), ('22_乌拉圭', 59, 61, 47, 19, 18), ('23_突尼斯', 9, 16, 9, 0, 5), ('24_塞内加尔', 6, 15, 9, 1, 7), ('27_哥斯达黎加', 19, 51, 31, 5, 19), ('30_埃及', 5, 15, 7, 0, 6), ('34_伊朗', 4, 9, 6, 1, 4), ('36_澳大利亚', 16, 47, 22, 4, 13), ('37_塞尔维亚', 25, 42, 28, 4, 18), ('39_摩洛哥', 2, 3, 2, 0, 1), ('51_尼日利亚', 21, 27, 17, 4, 9), ('53_巴拿马', 14, 56, 26, 3, 19), ('56_日本', 21, 35, 18, 6, 10), ('59_韩国', 13, 38, 16, 2, 12), ('62_俄罗斯', 26, 35, 24, 6, 11), ('65_沙特阿拉伯', 4, 22, 8, 0, 7)]
x_a = []
y_a = []
text_a = []
size_a = []
for i in a:
    x_a.append((i[3]-i[5])/i[3])
    y_a.append(i[1]/i[2])
    text_a.append(i[0])

trace1=go.Scatter(
    x=x_a,
    y=y_a,
    text=text_a,
    textposition="top center",
    mode="markers+text",
    marker=dict(
        size=10,
    )
)
layout=go.Layout(
    title='世界杯参赛队强对抗胜率参考',
    hovermode='closest',
    xaxis=dict(
               title='胜率',
               showline=True),
    yaxis=dict(
               title='进失球比',
               showline=True))
data=[trace1]
fig = go.Figure(data=data,layout=layout)
py.plot(fig)







